{"keras_version": "1.2.0", "config": [{"config": {"name": "lambda_1", "batch_input_shape": [null, 33, 100, 3], "function_type": "lambda", "input_dtype": "float32", "output_shape": [33, 100, 3], "trainable": true, "output_shape_type": "raw", "arguments": {}, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>4\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null]}, "class_name": "Lambda"}, {"config": {"name": "convolution2d_1", "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "trainable": true, "subsample": [2, 2], "nb_col": 5, "b_regularizer": null, "activation": "linear", "b_constraint": null, "W_constraint": null, "nb_row": 5, "nb_filter": 16, "bias": true, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"name": "elu_1", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.7}, "class_name": "Dropout"}, {"config": {"name": "convolution2d_2", "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "trainable": true, "subsample": [1, 1], "nb_col": 5, "b_regularizer": null, "activation": "linear", "b_constraint": null, "W_constraint": null, "nb_row": 5, "nb_filter": 32, "bias": true, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"name": "elu_2", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "dropout_2", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "convolution2d_3", "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "trainable": true, "subsample": [2, 2], "nb_col": 3, "b_regularizer": null, "activation": "linear", "b_constraint": null, "W_constraint": null, "nb_row": 3, "nb_filter": 48, "bias": true, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"name": "elu_3", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "dropout_3", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "convolution2d_4", "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "trainable": true, "subsample": [1, 1], "nb_col": 3, "b_regularizer": null, "activation": "linear", "b_constraint": null, "W_constraint": null, "nb_row": 3, "nb_filter": 64, "bias": true, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"name": "elu_4", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "dropout_4", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "output_dim": 48, "trainable": true, "W_constraint": null, "activation": "linear", "b_constraint": null, "b_regularizer": null, "bias": true, "input_dim": 3648}, "class_name": "Dense"}, {"config": {"name": "elu_5", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "dropout_5", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "dense_2", "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "output_dim": 32, "trainable": true, "W_constraint": null, "activation": "linear", "b_constraint": null, "b_regularizer": null, "bias": true, "input_dim": 48}, "class_name": "Dense"}, {"config": {"name": "elu_6", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "dropout_6", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "dense_3", "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "output_dim": 16, "trainable": true, "W_constraint": null, "activation": "linear", "b_constraint": null, "b_regularizer": null, "bias": true, "input_dim": 32}, "class_name": "Dense"}, {"config": {"name": "elu_7", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "dense_4", "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "output_dim": 1, "trainable": true, "W_constraint": null, "activation": "linear", "b_constraint": null, "b_regularizer": null, "bias": true, "input_dim": 16}, "class_name": "Dense"}], "class_name": "Sequential"}